app/Models/Pemesanan.php

    public function getDataPemesananRestoran($restoranId)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('Pemesanan');

        $builder->select('Pemesanan.id, Pemesanan.tanggalPemesanan as orderDate, sum(DetailPemesanan.harga * DetailPemesanan.jumlah) as totalHarga');
        $builder->join('DetailPemesanan', 'Pemesanan.id = DetailPemesanan.orderId');
        $builder->groupBy('Pemesanan.id');
        $builder->where('Pemesanan.restoranId', (int)$restoranId);
        $builder->orderBy('Pemesanan.tanggalPemesanan','DESC');

        $query = $builder->get();
---
SELECT `Pemesanan`.`id`, `Pemesanan`.`tanggalPemesanan` as `orderDate`, sum(DetailPemesanan.harga * DetailPemesanan.jumlah) as totalHarga
FROM `Pemesanan`
JOIN `DetailPemesanan` ON `Pemesanan`.`id` = `DetailPemesanan`.`orderId`
WHERE `Pemesanan`.`restoranId` = 1
GROUP BY `Pemesanan`.`id`
ORDER BY `Pemesanan`.`tanggalPemesanan` DESC